---
kind: method
id: M:Autodesk.Revit.DB.ElementId.op_LessThan(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
source: html/be2119ee-e068-3c5f-8bfe-3ac70c6091ea.htm
---
# Autodesk.Revit.DB.ElementId.op_LessThan Method

Determines whether this element id is less than another element id.

## Syntax (C#)
```csharp
public static bool operator <(
	ElementId elementId1,
	ElementId elementId2
)
```

## Parameters
- **elementId1** (`Autodesk.Revit.DB.ElementId`) - The first ElementId.
- **elementId2** (`Autodesk.Revit.DB.ElementId`) - The second ElementId.

## Returns
True if the first element id is less than the second element id, otherwise, false.